In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

In [13]:
# Import Pandas
import pandas as pd

In [18]:
file_path = r'C:\Users\Raghu\Instacart Basket Analysis\01 Project Management\02 Data\original data\products.csv'

In [19]:
df_prods = pd.read_csv(r'C:\Users\Raghu\Instacart Basket Analysis\01 Project Management\02 Data\original data\products.csv')

In [28]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
# Import Pandas
import pandas as pd

In [41]:
file_path = r'C:\Users\Raghu\Instacart Basket Analysis\01 Project Management\02 Data\03 Scripts\prepared data/orders_wrangled.csv'

In [42]:
df_ords = pd.read_csv(r'C:\Users\Raghu\Instacart Basket Analysis\01 Project Management\02 Data\03 Scripts\prepared data/orders_wrangled.csv'
)

In [43]:
df_ords.head()

,order_id,user_id,order_number,order_of_week,oder_hour_of _day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [44]:
df_ords.describe()

,order_id,user_id,order_number,order_of_week,oder_hour_of _day,days_since_prior_order
count,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,985475.000000
mean,1.710968e+06,3.156404e+04,1.717418e+01,2.778637e+00,1.345229e+01,11.102506
std,9.875774e+05,1.816695e+04,1.771094e+01,2.047751e+00,4.219144e+00,9.186663
min,6.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000
25%,8.554670e+05,1.589600e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000
50%,1.710657e+06,3.160800e+04,1.100000e+01,3.000000e+00,1.300000e+01,7.000000
75%,2.566970e+06,4.729700e+04,2.300000e+01,5.000000e+00,1.600000e+01,15.000000
max,3.421083e+06,6.310000e+04,1.000000e+02,6.000000e+00,2.300000e+01,30.000000

#Mixed-Type Data

In [45]:
df_test = pd.DataFrame()

In [46]:
df_test['mix'] = ['a', 'b', 1, True]

In [47]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [52]:
#mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\Raghu\AppData\Local\Temp\ipykernel_12684\1526145436.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [53]:
df_test['mix'] = df_test['mix'].astype('str')

In [55]:
#Finding Missing Values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [56]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [57]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [77]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [106]:
df = pd.read_csv(r'C:\Users\Raghu\Instacart Basket Analysis\01 Project Management\02 Data\original data\products.csv', index_col = False)

In [107]:
path = r'C:\Users\Raghu\Instacart Basket Analysis'

In [108]:
path

'C:\\Users\\Raghu\\Instacart Basket Analysis'

In [110]:
import os
import pandas as pd

In [111]:
csv_path = os.path.join(r'C:\Users\Raghu\Instacart Basket Analysis\01 Project Management\02 Data\original data\products.csv')

In [112]:
df = pd.read_csv(csv_path, index_col=False)

In [114]:
df = pd.read_csv(os.path.join(r'C:\Users\Raghu\Instacart Basket Analysis\01 Project Management\02 Data\original data\products.csv'), index_col = False)

In [115]:
df.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [120]:
df_prods.shape

(49693, 5)

In [121]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [122]:
df_prods_clean.shape

(49677, 5)

In [123]:
df_prods.dropna(inplace = True)

In [127]:
df_prods.dropna(subset = ['product_name'], inplace = True)

#Duplicates

In [128]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [129]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [130]:
df.drop_duplicates()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [131]:
df_prods_clean.shape

(49677, 5)

In [132]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [133]:
df_prods_clean_no_dups.shape

(49672, 5)

In [134]:
df.to_csv('cleaned_data.csv', index=False)

In [135]:
df.to_excel('cleaned_data.xlsx', index=False)

In [137]:
pip install pandas openpyxl

Requirement already satisfied: pandas in c:\users\raghu\anaconda3\lib\site-packages (2.1.1)
Requirement already satisfied: openpyxl in c:\users\raghu\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: numpy>=1.23.2 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: et_xmlfile in c:\users\raghu\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\users\raghu\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

Task
2. Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

In [138]:
df_ords.describe()

,order_id,user_id,order_number,order_of_week,oder_hour_of _day,days_since_prior_order
count,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,985475.000000
mean,1.710968e+06,3.156404e+04,1.717418e+01,2.778637e+00,1.345229e+01,11.102506
std,9.875774e+05,1.816695e+04,1.771094e+01,2.047751e+00,4.219144e+00,9.186663
min,6.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000
25%,8.554670e+05,1.589600e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000
50%,1.710657e+06,3.160800e+04,1.100000e+01,3.000000e+00,1.300000e+01,7.000000
75%,2.566970e+06,4.729700e+04,2.300000e+01,5.000000e+00,1.600000e+01,15.000000
max,3.421083e+06,6.310000e+04,1.000000e+02,6.000000e+00,2.300000e+01,30.000000

Answer 2: Investigating our frequency table, in particular the max and min section, it appears that days_since_prior_order has strange recordings. min is 0 and max is 3 (days), however double checking the percentile range, its seems the recording is strange. We have a 50th percentile of 7, which is higher than the max.
This is the case for number of orders, we have a min of 1 and max of 1, although the percentile ranges are inconsistent with this. For instance, 25% is recorded as 5, higher than the max of 1.

3. Check for mixed-type data in your df_ords dataframe.

In [139]:
df_ords.head()

,order_id,user_id,order_number,order_of_week,oder_hour_of _day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [145]:
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].apply(lambda x: x.map(type)) != df_ords[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_ords[weird]) > 0:
        print(col)

Answer 3: There are no mixed data type in the df_ords dataframe

4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

Answer 4: There are no columns with mixed data type in our df_ords data frame

5. Run a check for missing values in your df_ords dataframe.

In [146]:
df_ords.isnull().sum()

order_id                      0
user_id                       0
order_number                  0
order_of_week                 0
oder_hour_of _day             0
days_since_prior_order    63100
dtype: int64

#creating a new data frame df_nan for null values of column day_since_prior_order

In [147]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

#viewing new data frame df_ords_nan

In [149]:
df_ords_nan

,order_id,user_id,order_number,order_of_week,oder_hour_of _day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
1048523,1591766,63096,1,0,20,NaN
1048530,3391694,63097,1,2,14,NaN
1048541,1270497,63098,1,3,16,NaN
1048556,1877750,63099,1,0,10,NaN
1048570,1805240,63100,1,0,11,NaN

In [157]:
missing_values = df_ords.isnull().sum()

In [158]:
print("Missing values in df_ords:")
print(missing_values[missing_values > 0])

Missing values in df_ords:
days_since_prior_order    63100
dtype: int64

5.Run a check for missing values in your df_ords dataframe

In [159]:
missing_values = df_ords.isnull().sum()

In [160]:
if missing_values.sum() > 0:
    print("Columns with missing values:")
    print(missing_values[missing_values > 0])
else:
    print("No missing values found in df_ords.")

Columns with missing values:
days_since_prior_order    63100
dtype: int64

Answer 5: There are significant amounts of missing values for days_since_prior_order of 63100. If you look at the each column, it is apparent that NaN is linked with number of orders = 1. The total number of user_id = 206209, the same number of our missing values. This suggests that for all user_id = 1 have missing values within the column days_since_prior_order which relates to the number of orders.
This makes sense as customers who are purchasing for their first order, will not have any prior orders, and so that column will be left blank.

6. Address the missing values using an appropriate method.

Answer: This missing value is consistent with the data of first time orders and in itself provides information on our customer and their orders. This makes this column relevant and hence no action is required to remove data.

 7: Run a check for duplicate values in your df_ords data

In [170]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [171]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, order_of_week, oder_hour_of _day, days_since_prior_order]
Index: []

8. Address the duplicates using an appropriate method.

Answer 8: No duplicates found

Question 9: Export Data frame df_ords and df_prods

In [176]:
import os

In [180]:
df.to_csv('prods_data.csv', index=False)

In [181]:
os.makedirs(output_directory, exist_ok=True)

In [182]:
df_ords.to_csv(os.path.join(output_directory, 'prods_checked.csv'), index=False)

In [183]:
pip install pandas openpyxl

Requirement already satisfied: pandas in c:\users\raghu\anaconda3\lib\site-packages (2.1.1)
Requirement already satisfied: openpyxl in c:\users\raghu\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: numpy>=1.23.2 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: et_xmlfile in c:\users\raghu\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\users\raghu\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [184]:
df.to_csv('cleaned_data.csv', index=False)

In [185]:
df.to_excel('cleaned_data.xlsx', index=False)

In [186]:
pip install pandas openpyxl

Requirement already satisfied: pandas in c:\users\raghu\anaconda3\lib\site-packages (2.1.1)
Requirement already satisfied: openpyxl in c:\users\raghu\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: numpy>=1.23.2 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\raghu\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: et_xmlfile in c:\users\raghu\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\users\raghu\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.